I'm unable to reproduce this issue. I followed the instructions in "Steps to reproduce" and I always get a plan as expected.
Here's what I tried:
```terraform
➜  issue-2170 cat test.tf
variable "cluster_namespace" {
  default = "default"
}

variable "default_pod_cidr_blocks" {
  default = ["0.0.0.0/24"]
}

variable "default_service_cidr_blocks" {
  default = ["0.0.0.0/24"]
}

variable "control_plane_replicas" {
  default = 1
}

variable "control_plane_vm_class" {
  default = "default"
}

variable "default_storage_class" {
  default = "default"
}

resource "kubernetes_manifest" "repro_cluster" {
  manifest = {
    apiVersion = "cluster.x-k8s.io/v1beta1"
    kind       = "Cluster"

    metadata = {
      name        = "repro"
      namespace   = var.cluster_namespace
    }

    spec = {
      clusterNetwork = {
        pods          = { cidrBlocks = var.default_pod_cidr_blocks }
        services      = { cidrBlocks = var.default_service_cidr_blocks }
        serviceDomain = "cluster.local"
      }

      topology = {
        class = "tanzukubernetescluster"
        version = "v1.24..."

        controlPlane = {
          replicas     = var.control_plane_replicas
        }

        workers = {
          machineDeployments = [{
            class = "node-pool"
            name = "repro_pool"
            replicas = 1

            variables = {
              overrides = [
                { name = "vmClass", value = "best-effort-large" },
                # Uncommenting this line results in an error:
                # AttributeName("value"): can't use tftypes.String as tftypes.Tuple[tftypes.Object["effect":tftypes.String,│ "key":tftypes.String, "value":tftypes.String]]
                { name = "nodePoolTaints", value = [{ key = "foo", effect = "Equals", value = "bar" }] },
              ]
            }
          }]
        }

        variables = [
          # Uncommenting either of these lines results in a panic
          { name = "nodePoolVolumes", value = [] },
          { name = "nodePoolTaints", value = [] },
          { name = "storageClass", value = var.default_storage_class },
          { name = "vmClass", value = var.control_plane_vm_class }
        ]
      }
    }
  }
}

➜  issue-2170 terraform plan
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/kubernetes in /Users/alex/work/terraform-provider-kubernetes
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_manifest.repro_cluster will be created
  + resource "kubernetes_manifest" "repro_cluster" {
      + manifest = {
          + apiVersion = "cluster.x-k8s.io/v1beta1"
          + kind       = "Cluster"
          + metadata   = {
              + name      = "repro"
              + namespace = "default"
            }
          + spec       = {
              + clusterNetwork = {
                  + pods          = {
                      + cidrBlocks = [
                          + "0.0.0.0/24",
                        ]
                    }
                  + serviceDomain = "cluster.local"
                  + services      = {
                      + cidrBlocks = [
                          + "0.0.0.0/24",
                        ]
                    }
                }
              + topology       = {
                  + class        = "tanzukubernetescluster"
                  + controlPlane = {
                      + replicas = 1
                    }
                  + variables    = [
                      + {
                          + name  = "nodePoolVolumes"
                          + value = []
                        },
                      + {
                          + name  = "nodePoolTaints"
                          + value = []
                        },
                      + {
                          + name  = "storageClass"
                          + value = "default"
                        },
                      + {
                          + name  = "vmClass"
                          + value = "default"
                        },
                    ]
                  + version      = "v1.24..."
                  + workers      = {
                      + machineDeployments = [
                          + {
                              + class     = "node-pool"
                              + name      = "repro_pool"
                              + replicas  = 1
                              + variables = {
                                  + overrides = [
                                      + {
                                          + name  = "vmClass"
                                          + value = "best-effort-large"
                                        },
                                      + {
                                          + name  = "nodePoolTaints"
                                          + value = [
                                              + {
                                                  + effect = "Equals"
                                                  + key    = "foo"
                                                  + value  = "bar"
                                                },
                                            ]
                                        },
                                    ]
                                }
                            },
                        ]
                    }
                }
            }
        }
      + object   = {
          + apiVersion = "cluster.x-k8s.io/v1beta1"
          + kind       = "Cluster"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "repro"
              + namespace                  = "default"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + clusterNetwork       = {
                  + apiServerPort = (known after apply)
                  + pods          = {
                      + cidrBlocks = [
                          + "0.0.0.0/24",
                        ]
                    }
                  + serviceDomain = "cluster.local"
                  + services      = {
                      + cidrBlocks = [
                          + "0.0.0.0/24",
                        ]
                    }
                }
              + controlPlaneEndpoint = {
                  + host = (known after apply)
                  + port = (known after apply)
                }
              + controlPlaneRef      = {
                  + apiVersion      = (known after apply)
                  + fieldPath       = (known after apply)
                  + kind            = (known after apply)
                  + name            = (known after apply)
                  + namespace       = (known after apply)
                  + resourceVersion = (known after apply)
                  + uid             = (known after apply)
                }
              + infrastructureRef    = {
                  + apiVersion      = (known after apply)
                  + fieldPath       = (known after apply)
                  + kind            = (known after apply)
                  + name            = (known after apply)
                  + namespace       = (known after apply)
                  + resourceVersion = (known after apply)
                  + uid             = (known after apply)
                }
              + paused               = (known after apply)
              + topology             = {
                  + class        = "tanzukubernetescluster"
                  + controlPlane = {
                      + machineHealthCheck      = {
                          + enable              = (known after apply)
                          + maxUnhealthy        = (known after apply)
                          + nodeStartupTimeout  = (known after apply)
                          + remediationTemplate = {
                              + apiVersion      = (known after apply)
                              + fieldPath       = (known after apply)
                              + kind            = (known after apply)
                              + name            = (known after apply)
                              + namespace       = (known after apply)
                              + resourceVersion = (known after apply)
                              + uid             = (known after apply)
                            }
                          + unhealthyConditions = (known after apply)
                          + unhealthyRange      = (known after apply)
                        }
                      + metadata                = {
                          + annotations = (known after apply)
                          + labels      = (known after apply)
                        }
                      + nodeDeletionTimeout     = (known after apply)
                      + nodeDrainTimeout        = (known after apply)
                      + nodeVolumeDetachTimeout = (known after apply)
                      + replicas                = 1
                    }
                  + rolloutAfter = (known after apply)
                  + variables    = [
                      + {
                          + definitionFrom = (known after apply)
                          + name           = "nodePoolVolumes"
                          + value          = []
                        },
                      + {
                          + definitionFrom = (known after apply)
                          + name           = "nodePoolTaints"
                          + value          = []
                        },
                      + {
                          + definitionFrom = (known after apply)
                          + name           = "storageClass"
                          + value          = "default"
                        },
                      + {
                          + definitionFrom = (known after apply)
                          + name           = "vmClass"
                          + value          = "default"
                        },
                    ]
                  + version      = "v1.24..."
                  + workers      = {
                      + machineDeployments = [
                          + {
                              + class                   = "node-pool"
                              + failureDomain           = (known after apply)
                              + machineHealthCheck      = {
                                  + enable              = (known after apply)
                                  + maxUnhealthy        = (known after apply)
                                  + nodeStartupTimeout  = (known after apply)
                                  + remediationTemplate = {
                                      + apiVersion      = (known after apply)
                                      + fieldPath       = (known after apply)
                                      + kind            = (known after apply)
                                      + name            = (known after apply)
                                      + namespace       = (known after apply)
                                      + resourceVersion = (known after apply)
                                      + uid             = (known after apply)
                                    }
                                  + unhealthyConditions = (known after apply)
                                  + unhealthyRange      = (known after apply)
                                }
                              + metadata                = {
                                  + annotations = (known after apply)
                                  + labels      = (known after apply)
                                }
                              + minReadySeconds         = (known after apply)
                              + name                    = "repro_pool"
                              + nodeDeletionTimeout     = (known after apply)
                              + nodeDrainTimeout        = (known after apply)
                              + nodeVolumeDetachTimeout = (known after apply)
                              + replicas                = 1
                              + strategy                = {
                                  + rollingUpdate = {
                                      + deletePolicy   = (known after apply)
                                      + maxSurge       = (known after apply)
                                      + maxUnavailable = (known after apply)
                                    }
                                  + type          = (known after apply)
                                }
                              + variables               = {
                                  + overrides = [
                                      + {
                                          + definitionFrom = (known after apply)
                                          + name           = "vmClass"
                                          + value          = "best-effort-large"
                                        },
                                      + {
                                          + definitionFrom = (known after apply)
                                          + name           = "nodePoolTaints"
                                          + value          = [
                                              + {
                                                  + effect = "Equals"
                                                  + key    = "foo"
                                                  + value  = "bar"
                                                },
                                            ]
                                        },
                                    ]
                                }
                            },
                        ]
                    }
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.

➜  issue-2170 terraform version
Terraform v1.5.2
on darwin_arm64
+ provider registry.terraform.io/hashicorp/kubernetes v2.21.1
```